# Visible Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReferencePoint..::..Visible Property
ReferencePoint Class See Also
---
Whether the point is visible when the family is loaded into a project.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool Visible { get; set; }
```

Visual Basic
---
```text
Public Property Visible As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool Visible {
	bool get ();
	void set (bool value);
}
```

# See Also
ReferencePoint Class
Autodesk.Revit.DB Namespace